GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k80.inc
// Register: TMR3H
#define TMR3H TMR3H
TMR3H                                    equ 0FB3h
// bitfield definitions
TMR3H_TMR3H_POSN                         equ 0000h
TMR3H_TMR3H_POSITION                     equ 0000h
TMR3H_TMR3H_SIZE                         equ 0008h
TMR3H_TMR3H_LENGTH                       equ 0008h
TMR3H_TMR3H_MASK                         equ 00FFh

// Register: CMSTAT
#define CMSTAT CMSTAT
CMSTAT                                   equ 0FB4h
// bitfield definitions
CMSTAT_CMP1OUT_POSN                      equ 0006h
CMSTAT_CMP1OUT_POSITION                  equ 0006h
CMSTAT_CMP1OUT_SIZE                      equ 0001h
CMSTAT_CMP1OUT_LENGTH                    equ 0001h
CMSTAT_CMP1OUT_MASK                      equ 0040h
CMSTAT_CMP2OUT_POSN                      equ 0007h
CMSTAT_CMP2OUT_POSITION                  equ 0007h
CMSTAT_CMP2OUT_SIZE                      equ 0001h
CMSTAT_CMP2OUT_LENGTH                    equ 0001h
CMSTAT_CMP2OUT_MASK                      equ 0080h
CMSTAT_C2OUT_POSN                        equ 0006h
CMSTAT_C2OUT_POSITION                    equ 0006h
CMSTAT_C2OUT_SIZE                        equ 0001h
CMSTAT_C2OUT_LENGTH                      equ 0001h
CMSTAT_C2OUT_MASK                        equ 0040h
CMSTAT_C3OUT_POSN                        equ 0007h
CMSTAT_C3OUT_POSITION                    equ 0007h
CMSTAT_C3OUT_SIZE                        equ 0001h
CMSTAT_C3OUT_LENGTH                      equ 0001h
CMSTAT_C3OUT_MASK                        equ 0080h

// Register: CVRCON
#define CVRCON CVRCON
CVRCON                                   equ 0FB5h
// bitfield definitions
CVRCON_CVR_POSN                          equ 0000h
CVRCON_CVR_POSITION                      equ 0000h
CVRCON_CVR_SIZE                          equ 0005h
CVRCON_CVR_LENGTH                        equ 0005h
CVRCON_CVR_MASK                          equ 001Fh
CVRCON_CVRSS_POSN                        equ 0005h
CVRCON_CVRSS_POSITION                    equ 0005h
CVRCON_CVRSS_SIZE                        equ 0001h
CVRCON_CVRSS_LENGTH                      equ 0001h
CVRCON_CVRSS_MASK                        equ 0020h
CVRCON_CVROE_POSN                        equ 0006h
CVRCON_CVROE_POSITION                    equ 0006h
CVRCON_CVROE_SIZE                        equ 0001h
CVRCON_CVROE_LENGTH                      equ 0001h
CVRCON_CVROE_MASK                        equ 0040h
CVRCON_CVREN_POSN                        equ 0007h
CVRCON_CVREN_POSITION                    equ 0007h
CVRCON_CVREN_SIZE                        equ 0001h
CVRCON_CVREN_LENGTH                      equ 0001h
CVRCON_CVREN_MASK                        equ 0080h
CVRCON_CVR0_POSN                         equ 0000h
CVRCON_CVR0_POSITION                     equ 0000h
CVRCON_CVR0_SIZE                         equ 0001h
CVRCON_CVR0_LENGTH                       equ 0001h
CVRCON_CVR0_MASK                         equ 0001h
CVRCON_CVR1_POSN                         equ 0001h
CVRCON_CVR1_POSITION                     equ 0001h
CVRCON_CVR1_SIZE                         equ 0001h
CVRCON_CVR1_LENGTH                       equ 0001h
CVRCON_CVR1_MASK                         equ 0002h
CVRCON_CVR2_POSN                         equ 0002h
CVRCON_CVR2_POSITION                     equ 0002h
CVRCON_CVR2_SIZE                         equ 0001h
CVRCON_CVR2_LENGTH                       equ 0001h
CVRCON_CVR2_MASK                         equ 0004h
CVRCON_CVR3_POSN                         equ 0003h
CVRCON_CVR3_POSITION                     equ 0003h
CVRCON_CVR3_SIZE                         equ 0001h
CVRCON_CVR3_LENGTH                       equ 0001h
CVRCON_CVR3_MASK                         equ 0008h
CVRCON_CVR4_POSN                         equ 0004h
CVRCON_CVR4_POSITION                     equ 0004h
CVRCON_CVR4_SIZE                         equ 0001h
CVRCON_CVR4_LENGTH                       equ 0001h
CVRCON_CVR4_MASK                         equ 0010h
CVRCON_CVRR_POSN                         equ 0005h
CVRCON_CVRR_POSITION                     equ 0005h
CVRCON_CVRR_SIZE                         equ 0001h
CVRCON_CVRR_LENGTH                       equ 0001h
CVRCON_CVRR_MASK                         equ 0020h
CVRCON_CVROEN_POSN                       equ 0006h
CVRCON_CVROEN_POSITION                   equ 0006h
CVRCON_CVROEN_SIZE                       equ 0001h
CVRCON_CVROEN_LENGTH                     equ 0001h
CVRCON_CVROEN_MASK                       equ 0040h

// Register: PIE4
#define PIE4 PIE4
PIE4                                     equ 0FB6h
// bitfield definitions
PIE4_CCP3IE_POSN                         equ 0000h
PIE4_CCP3IE_POSITION                     equ 0000h
PIE4_CCP3IE_SIZE                         equ 0001h
PIE4_CCP3IE_LENGTH                       equ 0001h
PIE4_CCP3IE_MASK                         equ 0001h
PIE4_CCP4IE_POSN                         equ 0001h
PIE4_CCP4IE_POSITION                     equ 0001h
PIE4_CCP4IE_SIZE                         equ 0001h
PIE4_CCP4IE_LENGTH                       equ 0001h
PIE4_CCP4IE_MASK                         equ 0002h
PIE4_CCP5IE_POSN                         equ 0002h
PIE4_CCP5IE_POSITION                     equ 0002h
PIE4_CCP5IE_SIZE                         equ 0001h
PIE4_CCP5IE_LENGTH                       equ 0001h
PIE4_CCP5IE_MASK                         equ 0004h
PIE4_CMP1IE_POSN                         equ 0004h
PIE4_CMP1IE_POSITION                     equ 0004h
PIE4_CMP1IE_SIZE                         equ 0001h
PIE4_CMP1IE_LENGTH                       equ 0001h
PIE4_CMP1IE_MASK                         equ 0010h
PIE4_CMP2IE_POSN                         equ 0005h
PIE4_CMP2IE_POSITION                     equ 0005h
PIE4_CMP2IE_SIZE                         equ 0001h
PIE4_CMP2IE_LENGTH                       equ 0001h
PIE4_CMP2IE_MASK                         equ 0020h
PIE4_EEIE_POSN                           equ 0006h
PIE4_EEIE_POSITION                       equ 0006h
PIE4_EEIE_SIZE                           equ 0001h
PIE4_EEIE_LENGTH                         equ 0001h
PIE4_EEIE_MASK                           equ 0040h
PIE4_TMR4IE_POSN                         equ 0007h
PIE4_TMR4IE_POSITION                     equ 0007h
PIE4_TMR4IE_SIZE                         equ 0001h
PIE4_TMR4IE_LENGTH                       equ 0001h
PIE4_TMR4IE_MASK                         equ 0080h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 0FB7h
// bitfield definitions
PIR4_CCP3IF_POSN                         equ 0000h
PIR4_CCP3IF_POSITION                     equ 0000h
PIR4_CCP3IF_SIZE                         equ 0001h
PIR4_CCP3IF_LENGTH                       equ 0001h
PIR4_CCP3IF_MASK                         equ 0001h
PIR4_CCP4IF_POSN                         equ 0001h
PIR4_CCP4IF_POSITION                     equ 0001h
PIR4_CCP4IF_SIZE                         equ 0001h
PIR4_CCP4IF_LENGTH                       equ 0001h
PIR4_CCP4IF_MASK                         equ 0002h
PIR4_CCP5IF_POSN                         equ 0002h
PIR4_CCP5IF_POSITION                     equ 0002h
PIR4_CCP5IF_SIZE                         equ 0001h
PIR4_CCP5IF_LENGTH                       equ 0001h
PIR4_CCP5IF_MASK                         equ 0004h
PIR4_CMP1IF_POSN                         equ 0004h
PIR4_CMP1IF_POSITION                     equ 0004h
PIR4_CMP1IF_SIZE                         equ 0001h
PIR4_CMP1IF_LENGTH                       equ 0001h
PIR4_CMP1IF_MASK                         equ 0010h
PIR4_CMP2IF_POSN                         equ 0005h
PIR4_CMP2IF_POSITION                     equ 0005h
PIR4_CMP2IF_SIZE                         equ 0001h
PIR4_CMP2IF_LENGTH                       equ 0001h
PIR4_CMP2IF_MASK                         equ 0020h
PIR4_EEIF_POSN                           equ 0006h
PIR4_EEIF_POSITION                       equ 0006h
PIR4_EEIF_SIZE                           equ 0001h
PIR4_EEIF_LENGTH                         equ 0001h
PIR4_EEIF_MASK                           equ 0040h
PIR4_TMR4IF_POSN                         equ 0007h
PIR4_TMR4IF_POSITION                     equ 0007h
PIR4_TMR4IF_SIZE                         equ 0001h
PIR4_TMR4IF_LENGTH                       equ 0001h
PIR4_TMR4IF_MASK                         equ 0080h

