GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k80.inc
#define B5D60                            BANKMASK(B5D6), 0, b
#define B5D61                            BANKMASK(B5D6), 1, b
#define B5D62                            BANKMASK(B5D6), 2, b
#define B5D63                            BANKMASK(B5D6), 3, b
#define B5D64                            BANKMASK(B5D6), 4, b
#define B5D65                            BANKMASK(B5D6), 5, b
#define B5D66                            BANKMASK(B5D6), 6, b
#define B5D67                            BANKMASK(B5D6), 7, b
#define B5D70                            BANKMASK(B5D7), 0, b
#define B5D71                            BANKMASK(B5D7), 1, b
#define B5D72                            BANKMASK(B5D7), 2, b
#define B5D73                            BANKMASK(B5D7), 3, b
#define B5D74                            BANKMASK(B5D7), 4, b
#define B5D75                            BANKMASK(B5D7), 5, b
#define B5D76                            BANKMASK(B5D7), 6, b
#define B5D77                            BANKMASK(B5D7), 7, b
#define B5DLC0                           BANKMASK(B5DLC), 0, b
#define B5DLC1                           BANKMASK(B5DLC), 1, b
#define B5DLC2                           BANKMASK(B5DLC), 2, b
#define B5DLC3                           BANKMASK(B5DLC), 3, b
#define B5EID0                           BANKMASK(B5EIDL), 0, b
#define B5EID1                           BANKMASK(B5EIDL), 1, b
#define B5EID10                          BANKMASK(B5EIDH), 2, b
#define B5EID11                          BANKMASK(B5EIDH), 3, b
#define B5EID12                          BANKMASK(B5EIDH), 4, b
#define B5EID13                          BANKMASK(B5EIDH), 5, b
#define B5EID14                          BANKMASK(B5EIDH), 6, b
#define B5EID15                          BANKMASK(B5EIDH), 7, b
#define B5EID16                          BANKMASK(B5SIDL), 0, b
#define B5EID17                          BANKMASK(B5SIDL), 1, b
#define B5EID2                           BANKMASK(B5EIDL), 2, b
#define B5EID3                           BANKMASK(B5EIDL), 3, b
#define B5EID4                           BANKMASK(B5EIDL), 4, b
#define B5EID5                           BANKMASK(B5EIDL), 5, b
#define B5EID6                           BANKMASK(B5EIDL), 6, b
#define B5EID7                           BANKMASK(B5EIDL), 7, b
#define B5EID8                           BANKMASK(B5EIDH), 0, b
#define B5EID9                           BANKMASK(B5EIDH), 1, b
#define B5EXID                           BANKMASK(B5SIDL), 3, b
#define B5EXIDE                          BANKMASK(B5SIDL), 3, b
#define B5FILHIT0                        BANKMASK(B5CON), 0, b
#define B5FILHIT1                        BANKMASK(B5CON), 1, b
#define B5FILHIT2                        BANKMASK(B5CON), 2, b
#define B5FILHIT3                        BANKMASK(B5CON), 3, b
#define B5FILHIT4                        BANKMASK(B5CON), 4, b
#define B5IE                             BANKMASK(BIE0), 7, b
#define B5RB0                            BANKMASK(B5DLC), 4, b
#define B5RB1                            BANKMASK(B5DLC), 5, b
#define B5RTREN                          BANKMASK(B5CON), 2, b
#define B5RTRRO                          BANKMASK(B5CON), 5, b
#define B5RXFUL                          BANKMASK(B5CON), 7, b
#define B5RXM1                           BANKMASK(B5CON), 6, b
#define B5RXRTR                          BANKMASK(B5DLC), 6, b
#define B5SID0                           BANKMASK(B5SIDL), 5, b
#define B5SID1                           BANKMASK(B5SIDL), 6, b
#define B5SID10                          BANKMASK(B5SIDH), 7, b
#define B5SID2                           BANKMASK(B5SIDL), 7, b
#define B5SID3                           BANKMASK(B5SIDH), 0, b
#define B5SID4                           BANKMASK(B5SIDH), 1, b
#define B5SID5                           BANKMASK(B5SIDH), 2, b
#define B5SID6                           BANKMASK(B5SIDH), 3, b
#define B5SID7                           BANKMASK(B5SIDH), 4, b
#define B5SID8                           BANKMASK(B5SIDH), 5, b
#define B5SID9                           BANKMASK(B5SIDH), 6, b
#define B5SRR                            BANKMASK(B5SIDL), 4, b
#define B5TXABT                          BANKMASK(B5CON), 6, b
#define B5TXBIF                          BANKMASK(B5CON), 7, b
#define B5TXEN                           BANKMASK(BSEL0), 7, b
#define B5TXERR                          BANKMASK(B5CON), 4, b
#define B5TXLARB                         BANKMASK(B5CON), 5, b
#define B5TXPRI0                         BANKMASK(B5CON), 0, b
#define B5TXPRI1                         BANKMASK(B5CON), 1, b
#define B5TXREQ                          BANKMASK(B5CON), 3, b
#define BCLIE                            BANKMASK(PIE2), 3, a
#define BCLIF                            BANKMASK(PIR2), 3, a
#define BCLIP                            BANKMASK(IPR2), 3, a
#define BF                               BANKMASK(SSPSTAT), 0, a
#define BGVST                            BANKMASK(HLVDCON), 6, a
#define BOR                              BANKMASK(RCON), 0, a
#define BRG161                           BANKMASK(BAUDCON1), 3, a
#define BRG162                           BANKMASK(BAUDCON2), 3, a
#define BRGH1                            BANKMASK(TXSTA1), 2, a
#define BRGH2                            BANKMASK(TXSTA2), 2, a
#define BRP0                             BANKMASK(BRGCON1), 0, b
#define BRP1                             BANKMASK(BRGCON1), 1, b
#define BRP2                             BANKMASK(BRGCON1), 2, b
#define BRP3                             BANKMASK(BRGCON1), 3, b
#define BRP4                             BANKMASK(BRGCON1), 4, b
#define BRP5                             BANKMASK(BRGCON1), 5, b
#define C1CH0                            BANKMASK(CM1CON), 0, b
#define C1CH1                            BANKMASK(CM1CON), 1, b
#define C1TSEL                           BANKMASK(CCPTMRS), 0, a
#define C2OUT                            BANKMASK(CMSTAT), 6, a
#define C2TSEL                           BANKMASK(CCPTMRS), 1, a
#define C3OUT                            BANKMASK(CMSTAT), 7, a
#define C3TSEL                           BANKMASK(CCPTMRS), 2, a
#define C4TSEL                           BANKMASK(CCPTMRS), 3, a
#define C5TSEL                           BANKMASK(CCPTMRS), 4, a
#define CANCAP                           BANKMASK(CIOCON), 4, a
#define CARRY                            BANKMASK(STATUS), 0, a
#define CCH01                            BANKMASK(CM1CON), 0, b
#define CCH02                            BANKMASK(CM2CON), 0, b
#define CCH05                            BANKMASK(IPR5), 0, a
#define CCH11                            BANKMASK(CM1CON), 1, b
#define CCH12                            BANKMASK(CM2CON), 1, b
#define CCH15                            BANKMASK(IPR5), 1, a
#define CCIP3IP                          BANKMASK(IPR4), 0, a
#define CCP1IE                           BANKMASK(PIE3), 1, a
#define CCP1IF                           BANKMASK(PIR3), 1, a
#define CCP1IP                           BANKMASK(IPR3), 1, a
#define CCP1M0                           BANKMASK(CCP1CON), 0, a
#define CCP1M1                           BANKMASK(CCP1CON), 1, a
#define CCP1M2                           BANKMASK(CCP1CON), 2, a
#define CCP1M3                           BANKMASK(CCP1CON), 3, a
#define CCP1MD                           BANKMASK(PMD0), 3, b
#define CCP1OD                           BANKMASK(ODCON), 2, a
#define CCP1X                            BANKMASK(CCP1CON), 5, a
#define CCP1Y                            BANKMASK(CCP1CON), 4, a
#define CCP2                             BANKMASK(PORTC), 1, a
#define CCP2IE                           BANKMASK(PIE3), 2, a
#define CCP2IF                           BANKMASK(PIR3), 2, a
#define CCP2IP                           BANKMASK(IPR3), 2, a
#define CCP2M0                           BANKMASK(CCP2CON), 0, b
#define CCP2M1                           BANKMASK(CCP2CON), 1, b
#define CCP2M2                           BANKMASK(CCP2CON), 2, b
#define CCP2M3                           BANKMASK(CCP2CON), 3, b
#define CCP2MD                           BANKMASK(PMD0), 4, b
#define CCP2OD                           BANKMASK(ODCON), 3, a
#define CCP2X                            BANKMASK(CCP2CON), 5, b
#define CCP2Y                            BANKMASK(CCP2CON), 4, b
#define CCP2_PA2                         BANKMASK(PORTB), 3, a
#define CCP3IE                           BANKMASK(PIE4), 0, a
#define CCP3IF                           BANKMASK(PIR4), 0, a
#define CCP3IP                           BANKMASK(IPR4), 0, a
#define CCP3M0                           BANKMASK(CCP3CON), 0, b
#define CCP3M1                           BANKMASK(CCP3CON), 1, b
#define CCP3M2                           BANKMASK(CCP3CON), 2, b
#define CCP3M3                           BANKMASK(CCP3CON), 3, b
#define CCP3MD                           BANKMASK(PMD0), 5, b
#define CCP3OD                           BANKMASK(ODCON), 4, a
#define CCP3X                            BANKMASK(CCP3CON), 5, b
#define CCP3Y                            BANKMASK(CCP3CON), 4, b
#define CCP4IE                           BANKMASK(PIE4), 1, a
#define CCP4IF                           BANKMASK(PIR4), 1, a
#define CCP4IP                           BANKMASK(IPR4), 1, a
#define CCP4M0                           BANKMASK(CCP4CON), 0, b
#define CCP4M1                           BANKMASK(CCP4CON), 1, b
#define CCP4M2                           BANKMASK(CCP4CON), 2, b
#define CCP4M3                           BANKMASK(CCP4CON), 3, b
#define CCP4MD                           BANKMASK(PMD0), 6, b
#define CCP4OD                           BANKMASK(ODCON), 5, a
#define CCP4X                            BANKMASK(CCP4CON), 5, b
#define CCP4Y                            BANKMASK(CCP4CON), 4, b
#define CCP5IE                           BANKMASK(PIE4), 2, a
#define CCP5IF                           BANKMASK(PIR4), 2, a
#define CCP5IP                           BANKMASK(IPR4), 2, a
#define CCP5M0                           BANKMASK(CCP5CON), 0, b
#define CCP5M1                           BANKMASK(CCP5CON), 1, b
#define CCP5M2                           BANKMASK(CCP5CON), 2, b
#define CCP5M3                           BANKMASK(CCP5CON), 3, b
#define CCP5MD                           BANKMASK(PMD0), 7, b
#define CCP5OD                           BANKMASK(ODCON), 6, a
#define CCP5X                            BANKMASK(CCP5CON), 5, b
#define CCP5Y                            BANKMASK(CCP5CON), 4, b
#define CCP9E                            BANKMASK(PORTE), 3, a
#define CFGS                             BANKMASK(EECON1), 6, a
#define CHS0                             BANKMASK(ADCON0), 2, a
#define CHS1                             BANKMASK(ADCON0), 3, a
#define CHS2                             BANKMASK(ADCON0), 4, a
#define CHS3                             BANKMASK(ADCON0), 5, a
#define CHS4                             BANKMASK(ADCON0), 6, a
#define CHSN0                            BANKMASK(ADCON1), 0, a
#define CHSN1                            BANKMASK(ADCON1), 1, a
#define CHSN2                            BANKMASK(ADCON1), 2, a
#define CHSN3                            BANKMASK(ADCON1), 3, a
#define CKE                              BANKMASK(SSPSTAT), 6, a
#define CKP                              BANKMASK(SSPCON1), 4, a
#define CKTXP                            BANKMASK(BAUDCON1), 4, a
#define CLKSEL                           BANKMASK(CIOCON), 0, a
#define CM                               BANKMASK(RCON), 5, a
#define CMP1IE                           BANKMASK(PIE4), 4, a
#define CMP1IF                           BANKMASK(PIR4), 4, a
#define CMP1IP                           BANKMASK(IPR4), 4, a
#define CMP1MD                           BANKMASK(PMD2), 0, b
#define CMP1OUT                          BANKMASK(CMSTAT), 6, a
#define CMP2IE                           BANKMASK(PIE4), 5, a
#define CMP2IF                           BANKMASK(PIR4), 5, a
#define CMP2IP                           BANKMASK(IPR4), 5, a
#define CMP2MD                           BANKMASK(PMD2), 1, b
#define CMP2OUT                          BANKMASK(CMSTAT), 7, a
#define CMPL0                            BANKMASK(PSTR1CON), 6, a
#define CMPL1                            BANKMASK(PSTR1CON), 7, a
#define COE1                             BANKMASK(CM1CON), 6, b
#define COE2                             BANKMASK(CM2CON), 6, b
#define CON1                             BANKMASK(CM1CON), 7, b
#define CON2                             BANKMASK(CM2CON), 7, b
#define CPOL1                            BANKMASK(CM1CON), 5, b
#define CPOL2                            BANKMASK(CM2CON), 5, b
#define CREF1                            BANKMASK(CM1CON), 2, b
#define CREF2                            BANKMASK(CM2CON), 2, b
#define CREN1                            BANKMASK(RCSTA1), 4, a
#define CREN2                            BANKMASK(RCSTA2), 4, a
#define CSRC1                            BANKMASK(TXSTA1), 7, a
#define CSRC2                            BANKMASK(TXSTA2), 7, a
#define CTMUDS                           BANKMASK(PADCFG1), 0, b
#define CTMUEN                           BANKMASK(CTMUCONH), 7, b
#define CTMUIE                           BANKMASK(PIE3), 3, a
#define CTMUIF                           BANKMASK(PIR3), 3, a
#define CTMUIP                           BANKMASK(IPR3), 3, a
#define CTMUMD                           BANKMASK(PMD1), 6, b
#define CTMUSIDL                         BANKMASK(CTMUCONH), 5, b
#define CTTRIG                           BANKMASK(CTMUCONH), 0, b
#define CVR0                             BANKMASK(CVRCON), 0, a
#define CVR1                             BANKMASK(CVRCON), 1, a
#define CVR2                             BANKMASK(CVRCON), 2, a
#define CVR3                             BANKMASK(CVRCON), 3, a
#define CVR4                             BANKMASK(CVRCON), 4, a
#define CVREN                            BANKMASK(CVRCON), 7, a
#define CVROE                            BANKMASK(CVRCON), 6, a
#define CVROEN                           BANKMASK(CVRCON), 6, a
#define CVRR                             BANKMASK(CVRCON), 5, a
#define CVRSS                            BANKMASK(CVRCON), 5, a
#define DA                               BANKMASK(SSPSTAT), 5, a
#define DATA_ADDRESS                     BANKMASK(SSPSTAT), 5, a
#define DC                               BANKMASK(STATUS), 1, a
#define DC1B0                            BANKMASK(CCP1CON), 4, a
#define DC1B1                            BANKMASK(CCP1CON), 5, a
#define DC2B0                            BANKMASK(CCP2CON), 4, b
#define DC2B1                            BANKMASK(CCP2CON), 5, b
#define DC3B0                            BANKMASK(CCP3CON), 4, b
#define DC3B1                            BANKMASK(CCP3CON), 5, b
#define DC4B0                            BANKMASK(CCP4CON), 4, b
#define DC4B1                            BANKMASK(CCP4CON), 5, b
#define DC5B0                            BANKMASK(CCP5CON), 4, b
#define DC5B1                            BANKMASK(CCP5CON), 5, b
#define DONE                             BANKMASK(ADCON0), 1, a
#define DRXB0IE                          BANKMASK(BIE0), 0, b
#define DRXB1IE                          BANKMASK(BIE0), 1, b
#define DTRXP                            BANKMASK(BAUDCON1), 5, a
#define DTRXP1                           BANKMASK(BAUDCON1), 5, a
#define DTRXP2                           BANKMASK(BAUDCON2), 5, a
#define D_A                              BANKMASK(SSPSTAT), 5, a
#define D_NOT_A                          BANKMASK(SSPSTAT), 5, a
#define D_nA                             BANKMASK(SSPSTAT), 5, a
#define EBDIS                            BANKMASK(PR2), 7, a
#define ECANMD                           BANKMASK(PMD2), 2, b
#define ECCP1AS0                         BANKMASK(ECCP1AS), 4, a
#define ECCP1AS1                         BANKMASK(ECCP1AS), 5, a
#define ECCP1AS2                         BANKMASK(ECCP1AS), 6, a
#define ECCP1ASE                         BANKMASK(ECCP1AS), 7, a
#define EDG1POL                          BANKMASK(CTMUCONL), 4, b
#define EDG1SEL0                         BANKMASK(CTMUCONL), 2, b
#define EDG1SEL1                         BANKMASK(CTMUCONL), 3, b
#define EDG1STAT                         BANKMASK(CTMUCONL), 0, b
#define EDG2POL                          BANKMASK(CTMUCONL), 7, b
#define EDG2SEL0                         BANKMASK(CTMUCONL), 5, b
#define EDG2SEL1                         BANKMASK(CTMUCONL), 6, b
#define EDG2STAT                         BANKMASK(CTMUCONL), 1, b
#define EDGEN                            BANKMASK(CTMUCONH), 3, b
#define EDGSEQEN                         BANKMASK(CTMUCONH), 2, b
#define EDI16                            BANKMASK(RXB1SIDL), 0, b
#define EDI17                            BANKMASK(RXB1SIDL), 1, b
#define EEFS                             BANKMASK(EECON1), 6, a
#define EEIE                             BANKMASK(PIE4), 6, a
#define EEIF                             BANKMASK(PIR4), 6, a
#define EEIP                             BANKMASK(IPR4), 6, a
#define EEPGD                            BANKMASK(EECON1), 7, a
#define EMBMD                            BANKMASK(PMD1), 0, b
#define ENDRHI                           BANKMASK(CIOCON), 5, a
#define ERRIE                            BANKMASK(PIE5), 5, a
#define ERRIF                            BANKMASK(PIR5), 5, a
#define ERRIP                            BANKMASK(IPR5), 5, a
#define EVPOL01                          BANKMASK(CM1CON), 3, b
#define EVPOL02                          BANKMASK(CM2CON), 3, b
#define EVPOL05                          BANKMASK(IPR5), 3, a
#define EVPOL11                          BANKMASK(CM1CON), 4, b
#define EVPOL12                          BANKMASK(CM2CON), 4, b
#define EVPOL15                          BANKMASK(IPR5), 4, a
#define EWARN                            BANKMASK(COMSTAT), 0, a
#define EWIN0                            BANKMASK(ECANCON), 0, a
#define EWIN1                            BANKMASK(ECANCON), 1, a
#define EWIN2                            BANKMASK(ECANCON), 2, a
#define EWIN3                            BANKMASK(ECANCON), 3, a
#define EWIN4                            BANKMASK(ECANCON), 4, a
#define F0BP_0                           BANKMASK(RXFBCON0), 0, b
#define F0BP_01                          BANKMASK(RXFBCON0), 0, b
#define F0BP_1                           BANKMASK(RXFBCON0), 1, b
#define F0BP_2                           BANKMASK(RXFBCON0), 2, b
#define F0BP_3                           BANKMASK(RXFBCON0), 3, b
#define F10BP_0                          BANKMASK(RXFBCON5), 0, b
#define F10BP_01                         BANKMASK(RXFBCON5), 0, b
#define F10BP_1                          BANKMASK(RXFBCON5), 1, b
#define F10BP_2                          BANKMASK(RXFBCON5), 2, b
#define F10BP_3                          BANKMASK(RXFBCON5), 3, b
#define F11BP_0                          BANKMASK(RXFBCON5), 4, b
#define F11BP_1                          BANKMASK(RXFBCON5), 5, b
#define F11BP_2                          BANKMASK(RXFBCON5), 6, b
#define F11BP_3                          BANKMASK(RXFBCON5), 7, b
#define F12BP_0                          BANKMASK(RXFBCON6), 0, b
#define F12BP_01                         BANKMASK(RXFBCON6), 0, b
#define F12BP_1                          BANKMASK(RXFBCON6), 1, b
#define F12BP_2                          BANKMASK(RXFBCON6), 2, b
#define F12BP_3                          BANKMASK(RXFBCON6), 3, b
#define F13BP_0                          BANKMASK(RXFBCON6), 4, b
#define F13BP_1                          BANKMASK(RXFBCON6), 5, b
#define F13BP_2                          BANKMASK(RXFBCON6), 6, b
#define F13BP_3                          BANKMASK(RXFBCON6), 7, b
#define F14BP_0                          BANKMASK(RXFBCON7), 0, b
#define F14BP_01                         BANKMASK(RXFBCON7), 0, b
#define F14BP_1                          BANKMASK(RXFBCON7), 1, b
#define F14BP_2                          BANKMASK(RXFBCON7), 2, b
#define F14BP_3                          BANKMASK(RXFBCON7), 3, b
#define F15BP_0                          BANKMASK(RXFBCON7), 4, b
#define F15BP_1                          BANKMASK(RXFBCON7), 5, b
#define F15BP_2                          BANKMASK(RXFBCON7), 6, b
#define F15BP_3                          BANKMASK(RXFBCON7), 7, b
#define F1BP_0                           BANKMASK(RXFBCON0), 4, b
#define F1BP_1                           BANKMASK(RXFBCON0), 5, b
#define F1BP_2                           BANKMASK(RXFBCON0), 6, b
#define F1BP_3                           BANKMASK(RXFBCON0), 7, b
#define F2BP_0                           BANKMASK(RXFBCON1), 0, b
#define F2BP_01                          BANKMASK(RXFBCON1), 0, b
#define F2BP_1                           BANKMASK(RXFBCON1), 1, b
#define F2BP_2                           BANKMASK(RXFBCON1), 2, b
#define F2BP_3                           BANKMASK(RXFBCON1), 3, b
#define F3BP_0                           BANKMASK(RXFBCON1), 4, b
#define F3BP_1                           BANKMASK(RXFBCON1), 5, b
#define F3BP_2                           BANKMASK(RXFBCON1), 6, b
#define F3BP_3                           BANKMASK(RXFBCON1), 7, b
#define F4BP_0                           BANKMASK(RXFBCON2), 0, b
#define F4BP_01                          BANKMASK(RXFBCON2), 0, b
#define F4BP_1                           BANKMASK(RXFBCON2), 1, b
#define F4BP_2                           BANKMASK(RXFBCON2), 2, b
#define F4BP_3                           BANKMASK(RXFBCON2), 3, b
#define F5BP_0                           BANKMASK(RXFBCON2), 4, b
#define F5BP_1                           BANKMASK(RXFBCON2), 5, b
#define F5BP_2                           BANKMASK(RXFBCON2), 6, b
#define F5BP_3                           BANKMASK(RXFBCON2), 7, b
#define F6BP_0                           BANKMASK(RXFBCON3), 0, b
#define F6BP_01                          BANKMASK(RXFBCON3), 0, b
#define F6BP_1                           BANKMASK(RXFBCON3), 1, b
#define F6BP_2                           BANKMASK(RXFBCON3), 2, b
#define F6BP_3                           BANKMASK(RXFBCON3), 3, b
#define F7BP_0                           BANKMASK(RXFBCON3), 4, b
#define F7BP_1                           BANKMASK(RXFBCON3), 5, b
#define F7BP_2                           BANKMASK(RXFBCON3), 6, b
#define F7BP_3                           BANKMASK(RXFBCON3), 7, b
#define F8BP_0                           BANKMASK(RXFBCON4), 0, b
#define F8BP_01                          BANKMASK(RXFBCON4), 0, b
#define F8BP_1                           BANKMASK(RXFBCON4), 1, b
#define F8BP_2                           BANKMASK(RXFBCON4), 2, b
#define F8BP_3                           BANKMASK(RXFBCON4), 3, b
#define F9BP_0                           BANKMASK(RXFBCON4), 4, b
#define F9BP_1                           BANKMASK(RXFBCON4), 5, b
#define F9BP_2                           BANKMASK(RXFBCON4), 6, b
#define F9BP_3                           BANKMASK(RXFBCON4), 7, b
#define FERR1                            BANKMASK(RCSTA1), 2, a
#define FERR2                            BANKMASK(RCSTA2), 2, a
#define FIFOEMPTY                        BANKMASK(COMSTAT), 7, a
#define FIFOWM                           BANKMASK(ECANCON), 5, a
#define FIFOWMIE                         BANKMASK(PIE5), 0, a
#define FIFOWMIF                         BANKMASK(PIR5), 0, a
#define FIFOWMIP                         BANKMASK(IPR5), 0, a
#define FIL0_0                           BANKMASK(MSEL0), 0, b
#define FIL0_1                           BANKMASK(MSEL0), 1, b
#define FIL10_0                          BANKMASK(MSEL2), 4, b
#define FIL10_1                          BANKMASK(MSEL2), 5, b
#define FIL11_0                          BANKMASK(MSEL2), 6, b
#define FIL11_1                          BANKMASK(MSEL2), 7, b
#define FIL12_0                          BANKMASK(MSEL3), 0, b
#define FIL12_1                          BANKMASK(MSEL3), 1, b
#define FIL13_0                          BANKMASK(MSEL3), 2, b
#define FIL13_1                          BANKMASK(MSEL3), 3, b
